# CannotPasteNoLevelBelow Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..CopyPasteFailures..::..CannotPasteNoLevelBelow Property
BuiltInFailures..::..CopyPasteFailures Class See Also
---
Can't paste these elements at this height because there is no Level below to reference.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId CannotPasteNoLevelBelow { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property CannotPasteNoLevelBelow As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ CannotPasteNoLevelBelow {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..CopyPasteFailures Class
Autodesk.Revit.DB Namespace